//@skip-check bsl-legacy-check-static-feature-access-for-unknown-left-part

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализацияДанных() Экспорт
	
	Константы.кфкИспользоватьИнтеграцию.Установить(Истина);
	Константы.кфкИспользоватьПотоковыйРежим.Установить(Истина);
	
	Брокер = Брокер();
	
	Родитель = ПродюсерДЗ();
	ПродюсерСправочника(Брокер, Родитель);
	ПродюсерРегистра(Брокер, Родитель);
	ПродюсерРегистраПР(Брокер, Родитель);
	ПродюсерРегистраРН(Брокер, Родитель);
	
	Родитель = КонсьюмерДЗ();
	КонсьюмерСправочника(Брокер, Родитель);
	КонсьюмерРегистра(Брокер, Родитель);
	
КонецПроцедуры

Процедура ИнициализацияПользователей() Экспорт
	
	// Администратор
	Пользователь = Пользователи.СоздатьАдминистратора();
	ПользовательИБ = Пользователи.НайтиПоСсылке(Пользователь);
	ПользовательИБ.ЗащитаОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях = Ложь;
	ПользовательИБ.Записать();
	Пользователи.УстановитьПравоОткрытияВнешнихОтчетовИОбработок(Истина);
	
	// АдминистраторТакси
	Свойства = Пользователи.СвойстваПользователяИБ(ПользовательИБ.УникальныйИдентификатор); // Копирует свойства администратора
	Свойства.Имя = НСтр("ru = 'АдминистраторТакси'");
	Свойства.ПолноеИмя = НСтр("ru = 'Администратор (Такси)'");
	Пользователи.СлужебныйПользовательИБ(Свойства);
	ОтключитьПредупреждениеБезопасности(Свойства.Имя);
	ПользователиСлужебный.УстановитьНачальныеНастройки(Свойства.Имя);
	
	// Администратор Kafka
	Свойства = СвойстваАдминистратораKafka();
	Пользователи.СлужебныйПользовательИБ(Свойства);
	ОтключитьПредупреждениеБезопасности(Свойства.Имя);
	
	// Пользователь Kafka
	Свойства = СвойстваПользователяKafka();
	Пользователи.СлужебныйПользовательИБ(Свойства);
	ОтключитьПредупреждениеБезопасности(Свойства.Имя);
	
	// Снимаем флаг служебного пользователя у всех пользователей
	Запрос = Новый Запрос("ВЫБРАТЬ Справочник.Пользователи.Ссылка
	|ГДЕ Служебный = ИСТИНА И ИдентификаторПользователяИБ <> &ПустойИдентификатор");
	Запрос.УстановитьПараметр("ПустойИдентификатор", ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Объект = Выборка.Ссылка.ПолучитьОбъект(); // СправочникОбъект.Пользователи
		Объект.Служебный = Ложь;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(Объект, Ложь, Ложь);
	КонецЦикла;
	
КонецПроцедуры

#Область СсылкиТестовыхДанных

Функция СсылкаБрокераПоУмолчанию() Экспорт
	
	Возврат Справочники.кфкБрокеры.ПолучитьСсылку(
		Новый УникальныйИдентификатор("5f2b8c6a-6c75-4f8e-9d38-9b7f18d7a101"));
	
КонецФункции

Функция СсылкаГруппыПродюсеров() Экспорт
	
	Возврат Справочники.кфкПродюсеры.ПолучитьСсылку(
		Новый УникальныйИдентификатор("62c5b862-37d0-4c5a-9d9e-4be2fb976201"));
	
КонецФункции

Функция СсылкаПродюсераСправочника() Экспорт
	
	Возврат Справочники.кфкПродюсеры.ПолучитьСсылку(
		Новый УникальныйИдентификатор("2f5434af-037c-49fa-bf61-51df2a80e202"));
	
КонецФункции

Функция СсылкаПродюсераРегистра() Экспорт
	
	Возврат Справочники.кфкПродюсеры.ПолучитьСсылку(
		Новый УникальныйИдентификатор("75d6d507-e2e3-4d88-9741-464b6e8f6203"));
	
КонецФункции

Функция СсылкаПродюсераРегистраПР() Экспорт
	
	Возврат Справочники.кфкПродюсеры.ПолучитьСсылку(
		Новый УникальныйИдентификатор("3fb2e2db-f5b1-46a7-aacc-161fc8af6204"));
	
КонецФункции

Функция СсылкаПродюсераРегистраРН() Экспорт
	
	Возврат Справочники.кфкПродюсеры.ПолучитьСсылку(
		Новый УникальныйИдентификатор("9d925aec-04ef-4cbb-8c97-415a4a956205"));
	
КонецФункции

Функция СсылкаГруппыКонсьюмеров() Экспорт
	
	Возврат Справочники.кфкКонсьюмеры.ПолучитьСсылку(
		Новый УникальныйИдентификатор("0d087f4e-fd9f-4e92-a993-54d0a9a2c301"));
	
КонецФункции

Функция СсылкаКонсьюмераСправочника() Экспорт
	
	Возврат Справочники.кфкКонсьюмеры.ПолучитьСсылку(
		Новый УникальныйИдентификатор("31bfaba5-77f3-4ab8-bbeb-799f4bd6c302"));
	
КонецФункции

Функция СсылкаКонсьюмераРегистра() Экспорт
	
	Возврат Справочники.кфкКонсьюмеры.ПолучитьСсылку(
		Новый УникальныйИдентификатор("a6e357d4-d0bc-4684-b9f6-674fa7c7c303"));
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияДанных

Функция Брокер()

	Ссылка = СсылкаБрокераПоУмолчанию();
	Если ОбщегоНазначения.СсылкаСуществует(Ссылка) Тогда
		Объект = Ссылка.ПолучитьОбъект();
	Иначе
		Объект = Справочники.кфкБрокеры.СоздатьЭлемент();
		Объект.УстановитьСсылкуНового(Ссылка);
	КонецЕсли;
	
	Объект.Наименование = НСтр("ru = 'Брокер по умолчанию'");
	Объект.Узлы.Очистить();
	Объект.ПараметрыПодключения.Очистить();
	
	НоваяСтрока = Объект.Узлы.Добавить();
	НоваяСтрока.Использование = Истина;
	НоваяСтрока.Адрес = "localhost:29091";
	НоваяСтрока = Объект.Узлы.Добавить();
	НоваяСтрока.Использование = Истина;
	НоваяСтрока.Адрес = "localhost:29092";
	НоваяСтрока = Объект.Узлы.Добавить();
	НоваяСтрока.Использование = Ложь;
	НоваяСтрока.Адрес = "localhost:29093";
	
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции

#Область Продюсеры

Функция ПродюсерДЗ()
	
	Ссылка = СсылкаГруппыПродюсеров();
	Если ОбщегоНазначения.СсылкаСуществует(Ссылка) Тогда
		Объект = Ссылка.ПолучитьОбъект();
	Иначе
		Объект = Справочники.кфкПродюсеры.СоздатьГруппу();
		Объект.УстановитьСсылкуНового(Ссылка);
	КонецЕсли;
	
	Объект.Наименование = НСтр("ru = 'Диспетчер задач'");
	Объект.ПодпотокиОбработки = 2;
	Объект.ПодпотокиТранспорта = 1;
	
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции

Функция ПродюсерСправочника(Брокер, Родитель)
	
	Ссылка = СсылкаПродюсераСправочника();
	Если ОбщегоНазначения.СсылкаСуществует(Ссылка) Тогда
		Объект = Ссылка.ПолучитьОбъект();
	Иначе
		Объект = Справочники.кфкПродюсеры.СоздатьЭлемент();
		Объект.УстановитьСсылкуНового(Ссылка);
	КонецЕсли;
	
	Объект.Родитель = Родитель;
	Объект.Наименование = НСтр("ru = 'Продюсер: ТестовыйСправочник'");
	Объект.Брокер = Брокер;
	Объект.ОбъектыМетаданных.Очистить();
	Объект.ПараметрыПродюсера.Очистить();
	
	НоваяСтрока = Объект.ОбъектыМетаданных.Добавить();
	НоваяСтрока.ТипОбъект = "Справочник.кфк_т_ТестовыйСправочник";
	НоваяСтрока.ИмяТопика = "1c.test-catalog";
	НоваяСтрока.ТипСериализации = Перечисления.кфкТипыОбработчиков.ПроизвольныйОбработчик;
	НоваяСтрока.ИмяМетодаСериализации = "Справочники.кфк_т_ТестовыйСправочник.Сериализация";
	НоваяСтрока.ИмяМодуляСериализации = "кфк_т_МенеджерОбменаЧерезУниверсальныйФормат";
	НоваяСтрока.ИмяПОДСериализации = "Справочник_ТестовыйСправочник_Отправка";
	НоваяСтрока.ФорматСериализации = "http://v8.fsk.ru/kfk/test/1.0";
	
	НоваяСтрока = Объект.ПараметрыПродюсера.Добавить();
	НоваяСтрока.Ключ = "message.timeout.ms";
	НоваяСтрока.Значение = "5000";
	
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции

Функция ПродюсерРегистра(Брокер, Родитель)
	
	Ссылка = СсылкаПродюсераРегистра();
	Если ОбщегоНазначения.СсылкаСуществует(Ссылка) Тогда
		Объект = Ссылка.ПолучитьОбъект();
	Иначе
		Объект = Справочники.кфкПродюсеры.СоздатьЭлемент();
		Объект.УстановитьСсылкуНового(Ссылка);
	КонецЕсли;
	
	Объект.Родитель = Родитель;
	Объект.Наименование = НСтр("ru = 'Продюсер: Тестовый РС'");
	Объект.Брокер = Брокер;
	Объект.ОбъектыМетаданных.Очистить();
	Объект.ПараметрыПродюсера.Очистить();
	
	НоваяСтрока = Объект.ОбъектыМетаданных.Добавить();
	НоваяСтрока.ТипОбъект = "РегистрСведений.кфк_т_ТестовыйРегистрСведений";
	НоваяСтрока.ИмяТопика = "1c.test-register";
	НоваяСтрока.ТипСериализации = Перечисления.кфкТипыОбработчиков.ПроизвольныйОбработчик;
	НоваяСтрока.ИмяМетодаСериализации = "РегистрыСведений.кфк_т_ТестовыйРегистрСведений.Сериализация";
	НоваяСтрока.ИмяМодуляСериализации = "кфк_т_МенеджерОбменаЧерезУниверсальныйФормат";
	НоваяСтрока.ИмяПОДСериализации = "РегистрСведений_ТестовыйРегистрСведений_Отправка";
	НоваяСтрока.ФорматСериализации = "http://v8.fsk.ru/kfk/test/1.0";
	
	НоваяСтрока = Объект.ПараметрыПродюсера.Добавить();
	НоваяСтрока.Ключ = "message.timeout.ms";
	НоваяСтрока.Значение = "5000";
	
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции

Функция ПродюсерРегистраПР(Брокер, Родитель)
	
	Ссылка = СсылкаПродюсераРегистраПР();
	Если ОбщегоНазначения.СсылкаСуществует(Ссылка) Тогда
		Объект = Ссылка.ПолучитьОбъект();
	Иначе
		Объект = Справочники.кфкПродюсеры.СоздатьЭлемент();
		Объект.УстановитьСсылкуНового(Ссылка);
	КонецЕсли;
	
	Объект.Родитель = Родитель;
	Объект.Наименование = НСтр("ru = 'Продюсер: Тестовый РС (ПР)'");
	Объект.Брокер = Брокер;
	Объект.ОбъектыМетаданных.Очистить();
	Объект.ПараметрыПродюсера.Очистить();
	
	НоваяСтрока = Объект.ОбъектыМетаданных.Добавить();
	НоваяСтрока.ТипОбъект = "РегистрСведений.кфк_т_ТестовыйРегистрСведенийПР";
	НоваяСтрока.ИмяТопика = "1c.test-register-rs";
	НоваяСтрока.ТипСериализации = Перечисления.кфкТипыОбработчиков.ПроизвольныйОбработчик;
	НоваяСтрока.ИмяМетодаСериализации = "РегистрыСведений.кфк_т_ТестовыйРегистрСведенийПР.Сериализация";
	НоваяСтрока.ИмяМодуляСериализации = "кфк_т_МенеджерОбменаЧерезУниверсальныйФормат";
	НоваяСтрока.ИмяПОДСериализации = "РегистрСведений_ТестовыйРегистрСведенийПР_Отправка";
	НоваяСтрока.ФорматСериализации = "http://v8.fsk.ru/kfk/test/1.0";
	
	НоваяСтрока = Объект.ПараметрыПродюсера.Добавить();
	НоваяСтрока.Ключ = "message.timeout.ms";
	НоваяСтрока.Значение = "5000";
	
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции

Функция ПродюсерРегистраРН(Брокер, Родитель)
	
	Ссылка = СсылкаПродюсераРегистраРН();
	Если ОбщегоНазначения.СсылкаСуществует(Ссылка) Тогда
		Объект = Ссылка.ПолучитьОбъект();
	Иначе
		Объект = Справочники.кфкПродюсеры.СоздатьЭлемент();
		Объект.УстановитьСсылкуНового(Ссылка);
	КонецЕсли;
	
	Объект.Родитель = Родитель;
	Объект.Наименование = НСтр("ru = 'Продюсер: Тестовый РН'");
	Объект.Брокер = Брокер;
	Объект.ОбъектыМетаданных.Очистить();
	Объект.ПараметрыПродюсера.Очистить();
	
	НоваяСтрока = Объект.ОбъектыМетаданных.Добавить();
	НоваяСтрока.ТипОбъект = "РегистрНакопления.кфк_т_ТестовыйРегистрНакопления";
	НоваяСтрока.ИмяТопика = "1c.test-accumulation-register";
	НоваяСтрока.ТипСериализации = Перечисления.кфкТипыОбработчиков.ПроизвольныйОбработчик;
	НоваяСтрока.ИмяМетодаСериализации = "РегистрыНакопления.кфк_т_ТестовыйРегистрНакопления.Сериализация";
	НоваяСтрока.ИмяМодуляСериализации = "кфк_т_МенеджерОбменаЧерезУниверсальныйФормат";
	НоваяСтрока.ИмяПОДСериализации = "РегистрНакопления_ТестовыйРН_Отправка";
	НоваяСтрока.ФорматСериализации = "http://v8.fsk.ru/kfk/test/1.0";
	
	НоваяСтрока = Объект.ПараметрыПродюсера.Добавить();
	НоваяСтрока.Ключ = "message.timeout.ms";
	НоваяСтрока.Значение = "5000";
	
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции

#КонецОбласти

#Область Консьюмеры

Функция КонсьюмерДЗ()
	
	Ссылка = СсылкаГруппыКонсьюмеров();
	Если ОбщегоНазначения.СсылкаСуществует(Ссылка) Тогда
		Объект = Ссылка.ПолучитьОбъект();
	Иначе
		Объект = Справочники.кфкКонсьюмеры.СоздатьГруппу();
		Объект.УстановитьСсылкуНового(Ссылка);
	КонецЕсли;
	
	Объект.Наименование = НСтр("ru = 'Диспетчер задач'");
	Объект.ПодпотокиОбработки = 2;
	Объект.ПодпотокиТранспорта = 1;
	
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции

Функция КонсьюмерСправочника(Брокер, Родитель)
	
	Ссылка = СсылкаКонсьюмераСправочника();
	Если ОбщегоНазначения.СсылкаСуществует(Ссылка) Тогда
		Объект = Ссылка.ПолучитьОбъект();
	Иначе
		Объект = Справочники.кфкКонсьюмеры.СоздатьЭлемент();
		Объект.УстановитьСсылкуНового(Ссылка);
	КонецЕсли;
	
	Объект.Родитель = Родитель;
	Объект.Наименование = НСтр("ru = 'Консьюмер: ТестовыйСправочник'");
	Объект.Брокер = Брокер;
	Объект.Идентификатор = "1c-test";
	Объект.ТаймаутОжидания = 5000;
	Объект.Топики.Очистить();
	Объект.ПараметрыКонсьюмера.Очистить();
	
	НоваяСтрока = Объект.Топики.Добавить();
	НоваяСтрока.Топик = "1c.test-catalog";
	НоваяСтрока.ТипДесериализации = Перечисления.кфкТипыОбработчиков.ПроизвольныйОбработчик;
	НоваяСтрока.ИмяМетодаДесериализации = "Справочники.кфк_т_ТестовыйСправочник.Десериализация";
	НоваяСтрока.ИмяМодуляДесериализации = "кфк_т_МенеджерОбменаЧерезУниверсальныйФормат";
	НоваяСтрока.ИмяПОДДесериализации = "testCatalog_Получение";
	НоваяСтрока.ФорматДесериализации = "http://v8.fsk.ru/kfk/test/1.0";
	
	НоваяСтрока = Объект.ПараметрыКонсьюмера.Добавить();
	НоваяСтрока.Ключ = "auto.offset.reset";
	НоваяСтрока.Значение = "earliest";
	
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции

Функция КонсьюмерРегистра(Брокер, Родитель)
	
	Ссылка = СсылкаКонсьюмераРегистра();
	Если ОбщегоНазначения.СсылкаСуществует(Ссылка) Тогда
		Объект = Ссылка.ПолучитьОбъект();
	Иначе
		Объект = Справочники.кфкКонсьюмеры.СоздатьЭлемент();
		Объект.УстановитьСсылкуНового(Ссылка);
	КонецЕсли;
	
	Объект.Родитель = Родитель;
	Объект.Наименование = НСтр("ru = 'Консьюмер: Тестовый РС'");
	Объект.Брокер = Брокер;
	Объект.Идентификатор = "1c-test";
	Объект.ТаймаутОжидания = 5000;
	Объект.Топики.Очистить();
	Объект.ПараметрыКонсьюмера.Очистить();
	
	НоваяСтрока = Объект.Топики.Добавить();
	НоваяСтрока.Топик = "1c.test-register";
	НоваяСтрока.ТипДесериализации = Перечисления.кфкТипыОбработчиков.ПроизвольныйОбработчик;
	НоваяСтрока.ИмяМетодаДесериализации = "РегистрыСведений.кфк_т_ТестовыйРегистрСведений.Десериализация";
	НоваяСтрока.ИмяМодуляДесериализации = "кфк_т_МенеджерОбменаЧерезУниверсальныйФормат";
	НоваяСтрока.ИмяПОДДесериализации = "testRegister_Получение";
	НоваяСтрока.ФорматДесериализации = "http://v8.fsk.ru/kfk/test/1.0";
	
	НоваяСтрока = Объект.ПараметрыКонсьюмера.Добавить();
	НоваяСтрока.Ключ = "auto.offset.reset";
	НоваяСтрока.Значение = "earliest";
	
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область Пользователи

Функция СвойстваАдминистратораKafka()
	
	Свойства = СвойстваПользователяKafka();
	Свойства.Имя = НСтр("ru = 'АдминистраторKafka'");
	Свойства.ПолноеИмя = НСтр("ru = 'Администратор Kafka'");
	Свойства.Роли.Добавить("кфкПолныеПрава");
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(Свойства.Роли, "кфкБазовыеПрава");
	
	Возврат Свойства;
	
КонецФункции

Функция СвойстваПользователяKafka()
	
	Свойства = Пользователи.НовоеОписаниеПользователяИБ(Ложь, Ложь);
	Свойства.Имя = НСтр("ru = 'ПользовательKafka'");
	Свойства.ПолноеИмя = НСтр("ru = 'Пользователь Kafka'");
	Свойства.АутентификацияСтандартная = Истина;
	Свойства.ПоказыватьВСпискеВыбора = Истина;
	Свойства.Пароль = "";
	Свойства.ЗащитаОтОпасныхДействий = Ложь;
	
	Роли = Свойства.Роли;
	
//	Использование 1С:Предприятия.
	Роли.Добавить("ЗапускВебКлиента");
	Роли.Добавить("ЗапускТолстогоКлиента");
	Роли.Добавить("ЗапускТонкогоКлиента");
	Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	Роли.Добавить("СохранениеДанныхПользователя");
	Роли.Добавить("ИнтерактивноеОткрытиеВнешнихОтчетовИОбработок");
	
	// Использование программы.
	Роли.Добавить("БазовыеПраваБСП");
	Роли.Добавить("ПросмотрЖурналаРегистрации");
	Роли.Добавить("ПросмотрОписанияИзмененийПрограммы");
	
	// Типовые возможности.
	Роли.Добавить("ЧтениеВариантовОтчетов");
	Роли.Добавить("ДобавлениеИзменениеЛичныхВариантовОтчетов");
	
	// Основные возможности профиля.
	Роли.Добавить("кфкБазовыеПрава");
	Роли.Добавить("кфк_т_ДобавлениеИзменениеТестовыхДанных");
	
	Возврат Свойства;
	
КонецФункции

Процедура ОтключитьПредупреждениеБезопасности(ИмяПользователяИБ)
	
//	см. Пользователи.УстановитьПравоОткрытияВнешнихОтчетовИОбработок
	
	ОписаниеНастроек = Новый ОписаниеНастроек;
	ОписаниеНастроек.Представление = НСтр("ru = 'Предупреждение безопасности'");
	
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
		"ПредупреждениеБезопасности",
		"ПользовательОзнакомлен",
		Истина,
		ОписаниеНастроек,
		ИмяПользователяИБ);
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти
