//@skip-check bsl-legacy-check-static-feature-access-for-unknown-left-part

#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализацияДанных() Экспорт
	
	Константы.кфкИспользоватьИнтеграцию.Установить(Истина);
	Константы.кфкИспользоватьПотоковыйРежим.Установить(Истина);
	
	Брокер = Брокер();
	
	Родитель = ПродюсерДЗ();
	ПродюсерСправочника(Брокер, Родитель);
	ПродюсерРегистра(Брокер, Родитель);
	ПродюсерРегистраПР(Брокер, Родитель);
	ПродюсерРегистраРН(Брокер, Родитель);
	
	Родитель = КонсьюмерДЗ();
	КонсьюмерСправочника(Брокер, Родитель);
	КонсьюмерРегистра(Брокер, Родитель);
	
КонецПроцедуры

Процедура ИнициализацияПользователей() Экспорт
	
	// Администратор
	Пользователь = Пользователи.СоздатьАдминистратора();
	ПользовательИБ = Пользователи.НайтиПоСсылке(Пользователь);
	ПользовательИБ.ЗащитаОтОпасныхДействий.ПредупреждатьОбОпасныхДействиях = Ложь;
	ПользовательИБ.Записать(); 
	
	// Администратор Kafka
	Пользователи.СлужебныйПользовательИБ(СвойстваАдминистратораKafka());
	
	// Пользователь Kafka
	Пользователи.СлужебныйПользовательИБ(СвойстваПользователяKafka());
	
	// Снимаем флаг служебного пользователя у всех пользователей
	Запрос = Новый Запрос("ВЫБРАТЬ Справочник.Пользователи.Ссылка ГДЕ Служебный = ЛОЖЬ");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Объект = Выборка.Ссылка.ПолучитьОбъект(); // СправочникОбъект.Пользователи
		Объект.Служебный = Ложь;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(Объект, Ложь, Ложь);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияДанных

Функция Брокер()

	Объект = Справочники.кфкБрокеры.СоздатьЭлемент();
	Объект.Наименование = НСтр("ru = 'Брокер по умолчанию'");
	
	НоваяСтрока = Объект.Узлы.Добавить();
	НоваяСтрока.Использование = Истина;
	НоваяСтрока.Адрес = "localhost:29091";
	НоваяСтрока = Объект.Узлы.Добавить();
	НоваяСтрока.Использование = Истина;
	НоваяСтрока.Адрес = "localhost:29092";
	НоваяСтрока = Объект.Узлы.Добавить();
	НоваяСтрока.Использование = Ложь;
	НоваяСтрока.Адрес = "localhost:29093";
	
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции

#Область Продюсеры

Функция ПродюсерДЗ()
	
	Объект = Справочники.кфкПродюсеры.СоздатьГруппу();
	Объект.Наименование = НСтр("ru = 'Диспетчер задач'");
	Объект.ПодпотокиОбработки = 2;
	Объект.ПодпотокиТранспорта = 1;
	
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции

Функция ПродюсерСправочника(Брокер, Родитель)
	
	Объект = Справочники.кфкПродюсеры.СоздатьЭлемент();
	Объект.Родитель = Родитель;
	Объект.Наименование = НСтр("ru = 'Продюсер: ТестовыйСправочник'");
	Объект.Брокер = Брокер;
	
	НоваяСтрока = Объект.ОбъектыМетаданных.Добавить();
	НоваяСтрока.ТипОбъект = "Справочник.кфк_т_ТестовыйСправочник";
	НоваяСтрока.ИмяТопика = "1c.test-catalog";
	НоваяСтрока.ТипСериализации = Перечисления.кфкТипыОбработчиков.ПроизвольныйОбработчик;
	НоваяСтрока.ИмяМетодаСериализации = "Справочники.кфк_т_ТестовыйСправочник.Сериализация";
	НоваяСтрока.ИмяМодуляСериализации = "кфк_т_МенеджерОбменаЧерезУниверсальныйФормат";
	НоваяСтрока.ИмяПОДСериализации = "Справочник_ТестовыйСправочник_Отправка";
	НоваяСтрока.ФорматСериализации = "http://v8.fsk.ru/kfk/test/1.0";
	
	НоваяСтрока = Объект.ПараметрыПродюсера.Добавить();
	НоваяСтрока.Ключ = "message.timeout.ms";
	НоваяСтрока.Значение = "5000";
	
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции

Функция ПродюсерРегистра(Брокер, Родитель)
	
	Объект = Справочники.кфкПродюсеры.СоздатьЭлемент();
	Объект.Родитель = Родитель;
	Объект.Наименование = НСтр("ru = 'Продюсер: Тестовый РС'");
	Объект.Брокер = Брокер;
	
	НоваяСтрока = Объект.ОбъектыМетаданных.Добавить();
	НоваяСтрока.ТипОбъект = "РегистрСведений.кфк_т_ТестовыйРегистрСведений";
	НоваяСтрока.ИмяТопика = "1c.test-register";
	НоваяСтрока.ТипСериализации = Перечисления.кфкТипыОбработчиков.ПроизвольныйОбработчик;
	НоваяСтрока.ИмяМетодаСериализации = "РегистрыСведений.кфк_т_ТестовыйРегистрСведений.Сериализация";
	НоваяСтрока.ИмяМодуляСериализации = "кфк_т_МенеджерОбменаЧерезУниверсальныйФормат";
	НоваяСтрока.ИмяПОДСериализации = "РегистрСведений_ТестовыйРегистрСведений_Отправка";
	НоваяСтрока.ФорматСериализации = "http://v8.fsk.ru/kfk/test/1.0";
	
	НоваяСтрока = Объект.ПараметрыПродюсера.Добавить();
	НоваяСтрока.Ключ = "message.timeout.ms";
	НоваяСтрока.Значение = "5000";
	
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции

Функция ПродюсерРегистраПР(Брокер, Родитель)
	
	Объект = Справочники.кфкПродюсеры.СоздатьЭлемент();
	Объект.Родитель = Родитель;
	Объект.Наименование = НСтр("ru = 'Продюсер: Тестовый РС (ПР)'");
	Объект.Брокер = Брокер;
	
	НоваяСтрока = Объект.ОбъектыМетаданных.Добавить();
	НоваяСтрока.ТипОбъект = "РегистрСведений.кфк_т_ТестовыйРегистрСведенийПР";
	НоваяСтрока.ИмяТопика = "1c.test-register-rs";
	НоваяСтрока.ТипСериализации = Перечисления.кфкТипыОбработчиков.ПроизвольныйОбработчик;
	НоваяСтрока.ИмяМетодаСериализации = "РегистрыСведений.кфк_т_ТестовыйРегистрСведенийПР.Сериализация";
	НоваяСтрока.ИмяМодуляСериализации = "кфк_т_МенеджерОбменаЧерезУниверсальныйФормат";
	НоваяСтрока.ИмяПОДСериализации = "РегистрСведений_ТестовыйРегистрСведенийПР_Отправка";
	НоваяСтрока.ФорматСериализации = "http://v8.fsk.ru/kfk/test/1.0";
	
	НоваяСтрока = Объект.ПараметрыПродюсера.Добавить();
	НоваяСтрока.Ключ = "message.timeout.ms";
	НоваяСтрока.Значение = "5000";
	
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции

Функция ПродюсерРегистраРН(Брокер, Родитель)
	
	Объект = Справочники.кфкПродюсеры.СоздатьЭлемент();
	Объект.Родитель = Родитель;
	Объект.Наименование = НСтр("ru = 'Продюсер: Тестовый РН'");
	Объект.Брокер = Брокер;
	
	НоваяСтрока = Объект.ОбъектыМетаданных.Добавить();
	НоваяСтрока.ТипОбъект = "РегистрНакопления.кфк_т_ТестовыйРегистрНакопления";
	НоваяСтрока.ИмяТопика = "1c.test-accumulation-register";
	НоваяСтрока.ТипСериализации = Перечисления.кфкТипыОбработчиков.ПроизвольныйОбработчик;
	НоваяСтрока.ИмяМетодаСериализации = "РегистрыНакопления.кфк_т_ТестовыйРегистрНакопления.Сериализация";
	НоваяСтрока.ИмяМодуляСериализации = "кфк_т_МенеджерОбменаЧерезУниверсальныйФормат";
	НоваяСтрока.ИмяПОДСериализации = "РегистрНакопления_ТестовыйРН_Отправка";
	НоваяСтрока.ФорматСериализации = "http://v8.fsk.ru/kfk/test/1.0";
	
	НоваяСтрока = Объект.ПараметрыПродюсера.Добавить();
	НоваяСтрока.Ключ = "message.timeout.ms";
	НоваяСтрока.Значение = "5000";
	
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции

#КонецОбласти

#Область Консьюмеры

Функция КонсьюмерДЗ()
	
	Объект = Справочники.кфкКонсьюмеры.СоздатьГруппу();
	Объект.Наименование = НСтр("ru = 'Диспетчер задач'");
	Объект.ПодпотокиОбработки = 2;
	Объект.ПодпотокиТранспорта = 1;
	
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции

Функция КонсьюмерСправочника(Брокер, Родитель)
	
	Объект = Справочники.кфкКонсьюмеры.СоздатьЭлемент();
	Объект.Родитель = Родитель;
	Объект.Наименование = НСтр("ru = 'Консьюмер: ТестовыйСправочник'");
	Объект.Брокер = Брокер;
	Объект.Идентификатор = "1c-test";
	Объект.ТаймаутОжидания = 5000;
	
	НоваяСтрока = Объект.Топики.Добавить();
	НоваяСтрока.Топик = "1c.test-catalog";
	НоваяСтрока.ТипДесериализации = Перечисления.кфкТипыОбработчиков.ПроизвольныйОбработчик;
	НоваяСтрока.ИмяМетодаДесериализации = "Справочники.кфк_т_ТестовыйСправочник.Десериализация";
	НоваяСтрока.ИмяМодуляДесериализации = "кфк_т_МенеджерОбменаЧерезУниверсальныйФормат";
	НоваяСтрока.ИмяПОДДесериализации = "testCatalog_Получение";
	НоваяСтрока.ФорматДесериализации = "http://v8.fsk.ru/kfk/test/1.0";
	
	НоваяСтрока = Объект.ПараметрыКонсьюмера.Добавить();
	НоваяСтрока.Ключ = "enable.partition.eof";
	НоваяСтрока.Значение = "false";
	НоваяСтрока = Объект.ПараметрыКонсьюмера.Добавить();
	НоваяСтрока.Ключ = "enable.auto.offset.store";
	НоваяСтрока.Значение = "false";
	НоваяСтрока = Объект.ПараметрыКонсьюмера.Добавить();
	НоваяСтрока.Ключ = "enable.auto.commit";
	НоваяСтрока.Значение = "false";
	НоваяСтрока = Объект.ПараметрыКонсьюмера.Добавить();
	НоваяСтрока.Ключ = "auto.offset.reset";
	НоваяСтрока.Значение = "earliest";
	
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции

Функция КонсьюмерРегистра(Брокер, Родитель)
	
	Объект = Справочники.кфкКонсьюмеры.СоздатьЭлемент();
	Объект.Родитель = Родитель;
	Объект.Наименование = НСтр("ru = 'Консьюмер: Тестовый РС'");
	Объект.Брокер = Брокер;
	Объект.Идентификатор = "1c-test";
	Объект.ТаймаутОжидания = 5000;
	
	НоваяСтрока = Объект.Топики.Добавить();
	НоваяСтрока.Топик = "1c.test-register";
	НоваяСтрока.ТипДесериализации = Перечисления.кфкТипыОбработчиков.ПроизвольныйОбработчик;
	НоваяСтрока.ИмяМетодаДесериализации = "РегистрыСведений.кфк_т_ТестовыйРегистрСведений.Десериализация";
	НоваяСтрока.ИмяМодуляДесериализации = "кфк_т_МенеджерОбменаЧерезУниверсальныйФормат";
	НоваяСтрока.ИмяПОДДесериализации = "testRegister_Получение";
	НоваяСтрока.ФорматДесериализации = "http://v8.fsk.ru/kfk/test/1.0";
	
	НоваяСтрока = Объект.ПараметрыКонсьюмера.Добавить();
	НоваяСтрока.Ключ = "enable.partition.eof";
	НоваяСтрока.Значение = "false";
	НоваяСтрока = Объект.ПараметрыКонсьюмера.Добавить();
	НоваяСтрока.Ключ = "enable.auto.offset.store";
	НоваяСтрока.Значение = "false";
	НоваяСтрока = Объект.ПараметрыКонсьюмера.Добавить();
	НоваяСтрока.Ключ = "enable.auto.commit";
	НоваяСтрока.Значение = "false";
	НоваяСтрока = Объект.ПараметрыКонсьюмера.Добавить();
	НоваяСтрока.Ключ = "auto.offset.reset";
	НоваяСтрока.Значение = "earliest";
	
	Объект.ОбменДанными.Загрузка = Истина;
	Объект.Записать();
	
	Возврат Объект.Ссылка;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область Пользователи

Функция СвойстваАдминистратораKafka()
	
	Свойства = СвойстваПользователяKafka();
	Свойства.Имя = НСтр("ru = 'АдминистраторKafka'");
	Свойства.ПолноеИмя = НСтр("ru = 'Администратор Kafka'");
	Свойства.Роли.Добавить("кфкПолныеПрава");
	ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(Свойства.Роли, "кфкБазовыеПрава");
	
	Возврат Свойства;
	
КонецФункции

Функция СвойстваПользователяKafka()
	
	Свойства = Пользователи.НовоеОписаниеПользователяИБ(Ложь, Ложь);
	Свойства.Имя = НСтр("ru = 'ПользовательKafka'");
	Свойства.ПолноеИмя = НСтр("ru = 'Пользователь Kafka'");
	Свойства.АутентификацияСтандартная = Истина;
	Свойства.ПоказыватьВСпискеВыбора = Истина;
	Свойства.Пароль = "";
	Свойства.ЗащитаОтОпасныхДействий = Ложь;
	
	Роли = Свойства.Роли;
	
//	Использование 1С:Предприятия.
	Роли.Добавить("ЗапускВебКлиента");
	Роли.Добавить("ЗапускТолстогоКлиента");
	Роли.Добавить("ЗапускТонкогоКлиента");
	Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	Роли.Добавить("СохранениеДанныхПользователя");
	Роли.Добавить("ИнтерактивноеОткрытиеВнешнихОтчетовИОбработок");
	
	// Использование программы.
	Роли.Добавить("БазовыеПраваБСП");
	Роли.Добавить("ПросмотрЖурналаРегистрации");
	Роли.Добавить("ПросмотрОписанияИзмененийПрограммы");
	
	// Типовые возможности.
	Роли.Добавить("ЧтениеВариантовОтчетов");
	Роли.Добавить("ДобавлениеИзменениеЛичныхВариантовОтчетов");
	
	// Основные возможности профиля.
	Роли.Добавить("кфкБазовыеПрава");
	Роли.Добавить("кфк_т_ДобавлениеИзменениеТестовыхДанных");
	
	Возврат Свойства;
	
КонецФункции

#КонецОбласти

#КонецОбласти