//@skip-check undefined-variable

////////////////////////////////////////////////////////////////////////////////
// Менеджер обмена через универсальный формат (ТестированиеАдаптераKafka от 23.04.2026 13:27:59)
//
////////////////////////////////////////////////////////////////////////////////
#Область СлужебныйПрограммныйИнтерфейс
#Область ПроцедурыКонвертации
// Процедура, выполняемая перед началом конвертации данных.
//
// Параметры:
//  КомпонентыОбмена - см. кфкОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена
//  ДанныеИБ - СправочникОбъект, ДокументОбъект, Структура - выгружаемые данные ИБ
//
Процедура ПередКонвертацией(КомпонентыОбмена, ДанныеИБ) Экспорт
КонецПроцедуры

// Процедура, выполняемая после выполнения конвертации данных.
//
// Параметры:
//   КомпонентыОбмена - см. кфкОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена
//   ДанныеИБ - СправочникОбъект, ДокументОбъект, Структура - выгружаемые данные ИБ
//   Сообщение - Структура - сформированное сообщение
//
Процедура ПослеКонвертации(КомпонентыОбмена, ДанныеИБ, Сообщение) Экспорт
КонецПроцедуры

// Процедура, выполняемая перед началом отложенного заполнения объектов.
//
// Параметры:
//   КомпонентыОбмена - см. кфкОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена
//
Процедура ПередОтложеннымЗаполнением(КомпонентыОбмена) Экспорт
КонецПроцедуры

#КонецОбласти
// Возвращает версию формата менеджера обмена.
//
// Возвращаемое значение:
//  Строка - номер версии.
//   1 - базовые возможности
//   2 - расширенные возможности конвертации свойств табличных частей и общих составных свойств. Для БСП 2.4.1 и выше
//   3 - предусмотрен обход только заголовков при инициализации ПКС.
Функция ВерсияФорматаМенеджераОбмена() Экспорт
	Возврат "2.КФК";
КонецФункции

// Заполняет таблицу правил обработки данных.
//
// Параметры:
//  НаправлениеОбмена      - Строка - "Отправка" либо "Получение".
//  ПравилаОбработкиДанных - см. кфкОбменДаннымиXDTOСервер.ТаблицаПравилОбработкиДанных
// 
Процедура ЗаполнитьПравилаОбработкиДанных(НаправлениеОбмена, ПравилаОбработкиДанных) Экспорт
	Если НаправлениеОбмена = "Отправка" Тогда
		Если ПравилаОбработкиДанных.Колонки.Найти("ОчисткаДанных") = Неопределено Тогда
			ПравилаОбработкиДанных.Колонки.Добавить("ОчисткаДанных");
		КонецЕсли;
		ДобавитьПОД_РегистрНакопления_ТестовыйРН_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_РегистрСведений_ТестовыйРегистрСведений_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_РегистрСведений_ТестовыйРегистрСведенийПР_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_ТестовыйСправочник_Отправка(ПравилаОбработкиДанных);
	ИначеЕсли НаправлениеОбмена = "Получение" Тогда
		ДобавитьПОД_TestCatalog_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_TestRegister_Получение(ПравилаОбработкиДанных);
	КонецЕсли;
КонецПроцедуры
// Заполняет таблицу правил конвертации объектов.
//
// Параметры:
//  НаправлениеОбмена  - Строка - "Отправка" либо "Получение".
//  ПравилаКонвертации - ТаблицаЗначений - таблица значений, в которую будут добавлены правила.
// 
Процедура ЗаполнитьПравилаКонвертацииОбъектов(НаправлениеОбмена, ПравилаКонвертации) Экспорт
	Если НаправлениеОбмена = "Отправка" Тогда
		ДобавитьПКО_РегистрНакопления_ТестовыйРН_Отправка(ПравилаКонвертации);
	КонецЕсли;
	ДобавитьПКО_РегистрСведений_ТестовыйРегистрСведений(ПравилаКонвертации);
	ДобавитьПКО_РегистрСведений_ТестовыйРегистрСведенийПР(ПравилаКонвертации);
	ДобавитьПКО_Справочник_ТестовыйСправочник(ПравилаКонвертации);
КонецПроцедуры
#Область ПКПД
// Заполняет таблицу правил конвертации предопределенных данных.
//
// Параметры:
//  НаправлениеОбмена - Строка - "Отправка" либо "Получение".
//  ПравилаКонвертации - ТаблицаЗначений - таблица значений, в которую будут добавлены правила. 
Процедура ЗаполнитьПравилаКонвертацииПредопределенныхДанных(НаправлениеОбмена, ПравилаКонвертации) Экспорт

	// Перечисление_ТестовоеПеречисление.
	ПравилоКонвертации           = ПравилаКонвертации.Добавить();
	ПравилоКонвертации.ИмяПКПД   = "Перечисление_ТестовоеПеречисление";
	ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.кфк_т_ТестовоеПеречисление;
	ПравилоКонвертации.ТипXDTO   = "TestCatalog.Enum";

	ЗначенияДляОтправки = Новый Соответствие;
	ЗначенияДляОтправки.Вставить(Перечисления.кфк_т_ТестовоеПеречисление.Значение1, "Значение1");
	ЗначенияДляОтправки.Вставить(Перечисления.кфк_т_ТестовоеПеречисление.Значение2, "Значение2");
	ЗначенияДляОтправки.Вставить(Перечисления.кфк_т_ТестовоеПеречисление.Значение3, "Значение3");
	ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	ЗначенияДляПолучения = Новый Соответствие;
	ЗначенияДляПолучения.Вставить("Значение1", Перечисления.кфк_т_ТестовоеПеречисление.Значение1);
	ЗначенияДляПолучения.Вставить("Значение2", Перечисления.кфк_т_ТестовоеПеречисление.Значение2);
	ЗначенияДляПолучения.Вставить("Значение3", Перечисления.кфк_т_ТестовоеПеречисление.Значение3);
	ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;

КонецПроцедуры
#КонецОбласти

#Область ПараметрыКонвертации
// Заполняет параметры конвертации.
//
// Параметры:
//  ПараметрыКонвертации - Структура - структура, в которую добавляются параметры конвертации:
//                         Ключ - имя параметра, значение - значение параметра, по умолчанию - Неопределено.
//
Процедура ЗаполнитьПараметрыКонвертации(ПараметрыКонвертации) Экспорт
КонецПроцедуры

#КонецОбласти
// Процедура-обертка, выполняет запуск указанной в параметрах процедуры модуля менеджера обмена через формат.
//
// Параметры:
//  ИмяПроцедуры - Строка - имя процедуры этого модуля.
//  Параметры - Структура:
//    * ОбъектОбработки - Произвольный
//    * ИспользованиеПКО - Структура
//    * КомпонентыОбмена - см. кфкОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена
//    * ДанныеИБ - СправочникОбъект
//               - ДокументОбъект
//               - и т.п.
//    * ПолученныеДанные - СправочникОбъект
//                       - ДокументОбъект
//                       - и т.п.
//    * КонвертацияСвойств - ТаблицаЗначений
//    * ДанныеXDTO - см. кфкОбменДаннымиXDTOСервер.ДанныеXDTOИзДанныхИБ
//    * СтекВыгрузки - Массив из Произвольный
//
Процедура ВыполнитьПроцедуруМодуляМенеджера(ИмяПроцедуры, Параметры) Экспорт
КонецПроцедуры


#КонецОбласти
#Область СлужебныеПроцедурыИФункции
Функция Подключаемый_ИдентификаторМодуля() Экспорт
	Возврат "670fdffe-76ac-457a-9652-d527696b2cfb";
КонецФункции
#Область ПОД
#Область РегистрыНакопления
Процедура ДобавитьПОД_РегистрНакопления_ТестовыйРН_Отправка(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "РегистрНакопления_ТестовыйРН_Отправка";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.РегистрыНакопления.кфк_т_ТестовыйРегистрНакопления;
	ПравилоОбработки.ОчисткаДанных           = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("РегистрНакопления_ТестовыйРН_Отправка");
КонецПроцедуры


#КонецОбласти
#Область РегистрыСведений
Процедура ДобавитьПОД_TestRegister_Получение(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "TestRegister_Получение";
	ПравилоОбработки.ОбъектВыборкиФормат     = "TestRegister";
	ПравилоОбработки.ИспользуемыеПКО.Добавить("РегистрСведений_ТестовыйРегистрСведений");
КонецПроцедуры

Процедура ДобавитьПОД_РегистрСведений_ТестовыйРегистрСведений_Отправка(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "РегистрСведений_ТестовыйРегистрСведений_Отправка";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.РегистрыСведений.кфк_т_ТестовыйРегистрСведений;
	ПравилоОбработки.ОчисткаДанных           = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("РегистрСведений_ТестовыйРегистрСведений");
КонецПроцедуры

Процедура ДобавитьПОД_РегистрСведений_ТестовыйРегистрСведенийПР_Отправка(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "РегистрСведений_ТестовыйРегистрСведенийПР_Отправка";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.РегистрыСведений.кфк_т_ТестовыйРегистрСведенийПР;
	ПравилоОбработки.ОчисткаДанных           = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("РегистрСведений_ТестовыйРегистрСведенийПР");
КонецПроцедуры


#КонецОбласти
#Область Справочники
Процедура ДобавитьПОД_TestCatalog_Получение(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "TestCatalog_Получение";
	ПравилоОбработки.ОбъектВыборкиФормат     = "TestCatalog";
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_ТестовыйСправочник");
КонецПроцедуры

Процедура ДобавитьПОД_Справочник_ТестовыйСправочник_Отправка(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "Справочник_ТестовыйСправочник_Отправка";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Справочники.кфк_т_ТестовыйСправочник;
	ПравилоОбработки.ОчисткаДанных           = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_ТестовыйСправочник");
КонецПроцедуры


#КонецОбласти

#КонецОбласти
#Область ПКО
#Область РегистрыНакопления
Процедура ДобавитьПКО_РегистрНакопления_ТестовыйРН_Отправка(ПравилаКонвертации)
	ПравилоКонвертации = кфкОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО            = "РегистрНакопления_ТестовыйРН_Отправка";
	ПравилоКонвертации.ОбъектДанных      = Метаданные.РегистрыНакопления.кфк_т_ТестовыйРегистрНакопления;
	ПравилоКонвертации.ОбъектФормата     = "TestAccumulationRegister";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Значение",      "value");
	ДобавитьПКС(СвойстваШапки, "Идентификатор", "id");
	ДобавитьПКС(СвойстваШапки, "Период",        "period");
	ДобавитьПКС(СвойстваШапки, "Регистратор",   "recorder");
КонецПроцедуры


#КонецОбласти
// РегистрыНакопления
#Область РегистрыСведений
Процедура ДобавитьПКО_РегистрСведений_ТестовыйРегистрСведений(ПравилаКонвертации)
	ПравилоКонвертации = кфкОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО                             = "РегистрСведений_ТестовыйРегистрСведений";
	ПравилоКонвертации.ОбъектДанных                       = Метаданные.РегистрыСведений.кфк_т_ТестовыйРегистрСведений;
	ПравилоКонвертации.ОбъектФормата                      = "TestRegister";
	ПравилоКонвертации.ВариантИдентификации               = "ПоПолямПоиска";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Булево",         "boolean");
	ДобавитьПКС(СвойстваШапки, "ДатаИВремя",     "dateTime");
	ДобавитьПКС(СвойстваШапки, "Идентификатор",  "uuid");
	ДобавитьПКС(СвойстваШапки, "Комментарий",    "comment");
	ДобавитьПКС(СвойстваШапки, "Период",         "period");
	ДобавитьПКС(СвойстваШапки, "Строка",         "string");
	ДобавитьПКС(СвойстваШапки, "ТестоваяСсылка", "testRef");
	ДобавитьПКС(СвойстваШапки, "Число",          "number");
	ПравилоКонвертации.ПоляПоиска.Добавить("Период,ТестоваяСсылка,Булево,Строка,Число,ДатаИВремя,Идентификатор");
КонецПроцедуры

Процедура ДобавитьПКО_РегистрСведений_ТестовыйРегистрСведенийПР(ПравилаКонвертации)
	ПравилоКонвертации = кфкОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО                             = "РегистрСведений_ТестовыйРегистрСведенийПР";
	ПравилоКонвертации.ОбъектДанных                       = Метаданные.РегистрыСведений.кфк_т_ТестовыйРегистрСведенийПР;
	ПравилоКонвертации.ОбъектФормата                      = "TestRegisterRS";
	ПравилоКонвертации.ВариантИдентификации               = "ПоПолямПоиска";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Значение",      "value");
	ДобавитьПКС(СвойстваШапки, "Идентификатор", "id");
	ДобавитьПКС(СвойстваШапки, "Период",        "period");
	ДобавитьПКС(СвойстваШапки, "Регистратор",   "recorder");
	ПравилоКонвертации.ПоляПоиска.Добавить("Период,Регистратор,Идентификатор");
КонецПроцедуры


#КонецОбласти
// РегистрыСведений
#Область Справочники
Процедура ДобавитьПКО_Справочник_ТестовыйСправочник(ПравилаКонвертации)
	ПравилоКонвертации = кфкОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО                             = "Справочник_ТестовыйСправочник";
	ПравилоКонвертации.ОбъектДанных                       = Метаданные.Справочники.кфк_т_ТестовыйСправочник;
	ПравилоКонвертации.ОбъектФормата                      = "TestCatalog";
	ПравилоКонвертации.ВариантИдентификации               = "ПоУникальномуИдентификатору";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Булево",       "boolean");
	ДобавитьПКС(СвойстваШапки, "ДатаИВремя",   "dateTime");
	ДобавитьПКС(СвойстваШапки, "Комментарий",  "comment");
	ДобавитьПКС(СвойстваШапки, "Наименование", "name");
	ДобавитьПКС(СвойстваШапки, "Перечисление", "enum", , "Перечисление_ТестовоеПеречисление");
	ДобавитьПКС(СвойстваШапки, "Ссылка",       "ref");
	ДобавитьПКС(СвойстваШапки, "Число",        "number");
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "ТабличнаяЧасть", "tabularSection");
	ДобавитьПКС(СвойстваТЧ, "ДатаИВремя", "dateTime");
	ДобавитьПКС(СвойстваТЧ, "Строка",     "string");

КонецПроцедуры


#КонецОбласти
// Справочники

#КонецОбласти


Функция ДобавитьПКТЧ(ПравилоКонвертации, ИмяТЧКонфигурации, ИмяТЧФормата, ПространствоИмен = "")
	
	Если ПравилоКонвертации.СвойстваТабличныхЧастей.Колонки.Количество() = 0 Тогда
		кфкОбменДаннымиXDTOСервер.ИнициализироватьСвойстваТабличныхЧастей(ПравилоКонвертации);
	КонецЕсли;
	
	КонвертацияТабличнойЧасти                = ПравилоКонвертации.СвойстваТабличныхЧастей.Добавить();
	КонвертацияТабличнойЧасти.ТЧКонфигурации = ИмяТЧКонфигурации;
	КонвертацияТабличнойЧасти.ТЧФормата      = ИмяТЧФормата;
	КонвертацияТабличнойЧасти.Свойства       = кфкОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации();
	КонвертацияТабличнойЧасти.ПространствоИмен = ПространствоИмен;
	Возврат КонвертацияТабличнойЧасти.Свойства;
КонецФункции

Процедура ДобавитьПКС(РодительПКС, СвойствоКонфигурации, СвойствоФормата, ИспользуетсяАлгоритмКонвертации = 0, 
		ПравилоКонвертацииСвойства = "", ПространствоИмен = "")
	НоваяСтрока                                 = РодительПКС.Добавить();
	НоваяСтрока.СвойствоКонфигурации            = СвойствоКонфигурации;
	НоваяСтрока.СвойствоФормата                 = СвойствоФормата;
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = ?(ИспользуетсяАлгоритмКонвертации = 0, Ложь, Истина);
	НоваяСтрока.ПравилоКонвертацииСвойства      = ПравилоКонвертацииСвойства;
	НоваяСтрока.ПространствоИмен                = ПространствоИмен;
КонецПроцедуры

#Область ОбработчикиКонвертации

#КонецОбласти
#Область Алгоритмы


#КонецОбласти

#КонецОбласти
