//@skip-check undefined-variable

////////////////////////////////////////////////////////////////////////////////
// Менеджер обмена через универсальный формат (Тестирование адаптера kafka от 15.10.2026 13:44:17)
//
////////////////////////////////////////////////////////////////////////////////
#Область СлужебныйПрограммныйИнтерфейс
#Область ПроцедурыКонвертации
// Процедура, выполняемая перед началом конвертации данных.
//
// Параметры:
//  КомпонентыОбмена - см. кфкОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена
//  ДанныеИБ - СправочникОбъект, ДокументОбъект, Структура - выгружаемые данные ИБ
//
Процедура ПередКонвертацией(КомпонентыОбмена, ДанныеИБ) Экспорт
КонецПроцедуры

// Процедура, выполняемая после выполнения конвертации данных.
//
// Параметры:
//   КомпонентыОбмена - см. кфкОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена
//   ДанныеИБ - СправочникОбъект, ДокументОбъект, Структура - выгружаемые данные ИБ
//   Сообщение - Структура - сформированное сообщение
//
Процедура ПослеКонвертации(КомпонентыОбмена, ДанныеИБ, Сообщение) Экспорт
КонецПроцедуры

// Процедура, выполняемая перед началом отложенного заполнения объектов.
//
// Параметры:
//   КомпонентыОбмена - см. кфкОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена
//
Процедура ПередОтложеннымЗаполнением(КомпонентыОбмена) Экспорт
КонецПроцедуры

#КонецОбласти
// Возвращает версию формата менеджера обмена.
//
// Возвращаемое значение:
//  Строка - номер версии.
//   1 - базовые возможности
//   2 - расширенные возможности конвертации свойств табличных частей и общих составных свойств. Для БСП 2.4.1 и выше
//   3 - предусмотрен обход только заголовков при инициализации ПКС.
Функция ВерсияФорматаМенеджераОбмена() Экспорт
	Возврат "2.КФК";
КонецФункции

// Заполняет таблицу правил обработки данных.
//
// Параметры:
//  НаправлениеОбмена      - Строка - "Отправка" либо "Получение".
//  ПравилаОбработкиДанных - см. кфкОбменДаннымиXDTOСервер.ТаблицаПравилОбработкиДанных
// 
Процедура ЗаполнитьПравилаОбработкиДанных(НаправлениеОбмена, ПравилаОбработкиДанных) Экспорт
	Если НаправлениеОбмена = "Отправка" Тогда
		Если ПравилаОбработкиДанных.Колонки.Найти("ОчисткаДанных") = Неопределено Тогда
			ПравилаОбработкиДанных.Колонки.Добавить("ОчисткаДанных");
		КонецЕсли;
		ДобавитьПОД_Документ_ТестовыйДокумент_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_РегистрНакопления_ТестовыйРегистрНакоп_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_РегистрСведений_ТестовыйРегистрСведений_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_РегистрСведений_ТестовыйРегистрСведенийПР_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_ТестовыйСправочник_Отправка(ПравилаОбработкиДанных);
	ИначеЕсли НаправлениеОбмена = "Получение" Тогда
		ДобавитьПОД_TestCatalogs_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_TestDocuments_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_TestInformationRegisters_Получение(ПравилаОбработкиДанных);
	КонецЕсли;
КонецПроцедуры
// Заполняет таблицу правил конвертации объектов.
//
// Параметры:
//  НаправлениеОбмена  - Строка - 'Отправка' либо 'Получение'.
//  ПравилаКонвертации - ТаблицаЗначений - таблица значений, в которую будут добавлены правила.
// 
Процедура ЗаполнитьПравилаКонвертацииОбъектов(НаправлениеОбмена, ПравилаКонвертации) Экспорт
	Если НаправлениеОбмена = "Отправка" Тогда
		ДобавитьПКО_РегистрНакопления_ТестовыйРегистрНакоп_Отправка(ПравилаКонвертации);
		ДобавитьПКО_РегистрСведений_ТестовыйРегистрСведенийПР_Отправка(ПравилаКонвертации);
	КонецЕсли;
	ДобавитьПКО_Документ_ТестовыйДокумент(ПравилаКонвертации);
	ДобавитьПКО_РегистрСведений_ТестовыйРегистрСведений(ПравилаКонвертации);
	ДобавитьПКО_Справочник_ТестовыйСправочник(ПравилаКонвертации);
КонецПроцедуры
#Область ПКПД
// Заполняет таблицу правил конвертации предопределенных данных.
//
// Параметры:
//  НаправлениеОбмена  - Строка - 'Отправка' либо 'Получение'.
//  ПравилаКонвертации - ТаблицаЗначений - таблица значений, в которую будут добавлены правила. 
Процедура ЗаполнитьПравилаКонвертацииПредопределенныхДанных(НаправлениеОбмена, ПравилаКонвертации) Экспорт

	// Перечисление_ТестовоеПеречисление.
	ПравилоКонвертации           = ПравилаКонвертации.Добавить();
	ПравилоКонвертации.ИмяПКПД   = "Перечисление_ТестовоеПеречисление";
	ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.кфк_т_ТестовоеПеречисление;
	ПравилоКонвертации.ТипXDTO   = "EnumerationEnum";

	ЗначенияДляОтправки = Новый Соответствие;
	ЗначенияДляОтправки.Вставить(Перечисления.кфк_т_ТестовоеПеречисление.Значение1, "Значение1");
	ЗначенияДляОтправки.Вставить(Перечисления.кфк_т_ТестовоеПеречисление.Значение2, "Значение2");
	ЗначенияДляОтправки.Вставить(Перечисления.кфк_т_ТестовоеПеречисление.Значение3, "Значение3");
	ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	ЗначенияДляПолучения = Новый Соответствие;
	ЗначенияДляПолучения.Вставить("Значение1", Перечисления.кфк_т_ТестовоеПеречисление.Значение1);
	ЗначенияДляПолучения.Вставить("Значение2", Перечисления.кфк_т_ТестовоеПеречисление.Значение2);
	ЗначенияДляПолучения.Вставить("Значение3", Перечисления.кфк_т_ТестовоеПеречисление.Значение3);
	ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;

КонецПроцедуры
#КонецОбласти

#Область ПараметрыКонвертации
// Заполняет параметры конвертации.
//
// Параметры:
//  ПараметрыКонвертации - Структура - структура, в которую добавляются параметры конвертации:
//                         Ключ - имя параметра, значение - значение параметра, по умолчанию - Неопределено.
//
Процедура ЗаполнитьПараметрыКонвертации(ПараметрыКонвертации) Экспорт
КонецПроцедуры

#КонецОбласти
// Процедура-обертка, выполняет запуск указанной в параметрах процедуры модуля менеджера обмена через формат.
//
// Параметры:
//  ИмяПроцедуры - Строка - имя процедуры этого модуля.
//  Параметры - Структура:
//    * ОбъектОбработки - Произвольный
//    * ИспользованиеПКО - Структура
//    * КомпонентыОбмена - см. кфкОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена
//    * ДанныеИБ - СправочникОбъект
//               - ДокументОбъект
//               - и т.п.
//    * ПолученныеДанные - СправочникОбъект
//                       - ДокументОбъект
//                       - и т.п.
//    * КонвертацияСвойств - ТаблицаЗначений
//    * ДанныеXDTO - см. кфкОбменДаннымиXDTOСервер.ДанныеXDTOИзДанныхИБ
//    * СтекВыгрузки - Массив из Произвольный
//
Процедура ВыполнитьПроцедуруМодуляМенеджера(ИмяПроцедуры, Параметры) Экспорт
КонецПроцедуры


#КонецОбласти
#Область СлужебныеПроцедурыИФункции
Функция Подключаемый_ИдентификаторМодуля() Экспорт
	Возврат "8b522557-9023-4a04-b694-dc580d06c593";
КонецФункции
#Область ПОД
#Область Документы
Процедура ДобавитьПОД_TestDocuments_Получение(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "TestDocuments_Получение";
	ПравилоОбработки.ОбъектВыборкиФормат     = "TestDocuments";
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_ТестовыйДокумент");
КонецПроцедуры

Процедура ДобавитьПОД_Документ_ТестовыйДокумент_Отправка(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "Документ_ТестовыйДокумент_Отправка";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Документы.кфк_т_ТестовыйДокумент;
	ПравилоОбработки.ОчисткаДанных           = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Документ_ТестовыйДокумент");
КонецПроцедуры


#КонецОбласти
#Область РегистрыНакопления
Процедура ДобавитьПОД_РегистрНакопления_ТестовыйРегистрНакоп_Отправка(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "РегистрНакопления_ТестовыйРегистрНакоп_Отправка";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.РегистрыНакопления.кфк_т_ТестовыйРегистрНакопления;
	ПравилоОбработки.ОчисткаДанных           = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("РегистрНакопления_ТестовыйРегистрНакоп_Отправка");
КонецПроцедуры


#КонецОбласти
#Область РегистрыСведений
Процедура ДобавитьПОД_TestInformationRegisters_Получение(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "TestInformationRegisters_Получение";
	ПравилоОбработки.ОбъектВыборкиФормат     = "TestInformationRegisters";
	ПравилоОбработки.ИспользуемыеПКО.Добавить("РегистрСведений_ТестовыйРегистрСведений");
КонецПроцедуры

Процедура ДобавитьПОД_РегистрСведений_ТестовыйРегистрСведений_Отправка(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "РегистрСведений_ТестовыйРегистрСведений_Отправка";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.РегистрыСведений.кфк_т_ТестовыйРегистрСведений;
	ПравилоОбработки.ОчисткаДанных           = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("РегистрСведений_ТестовыйРегистрСведений");
КонецПроцедуры

Процедура ДобавитьПОД_РегистрСведений_ТестовыйРегистрСведенийПР_Отправка(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "РегистрСведений_ТестовыйРегистрСведенийПР_Отправка";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.РегистрыСведений.кфк_т_ТестовыйРегистрСведенийПР;
	ПравилоОбработки.ОчисткаДанных           = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("РегистрСведений_ТестовыйРегистрСведенийПР_Отправка");
КонецПроцедуры


#КонецОбласти
#Область Справочники
Процедура ДобавитьПОД_TestCatalogs_Получение(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "TestCatalogs_Получение";
	ПравилоОбработки.ОбъектВыборкиФормат     = "TestCatalogs";
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_ТестовыйСправочник");
КонецПроцедуры

Процедура ДобавитьПОД_Справочник_ТестовыйСправочник_Отправка(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "Справочник_ТестовыйСправочник_Отправка";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Справочники.кфк_т_ТестовыйСправочник;
	ПравилоОбработки.ОчисткаДанных           = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_ТестовыйСправочник");
КонецПроцедуры


#КонецОбласти

#КонецОбласти
#Область ПКО
#Область Документы
Процедура ДобавитьПКО_Документ_ТестовыйДокумент(ПравилаКонвертации)
	ПравилоКонвертации = кфкОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО                             = "Документ_ТестовыйДокумент";
	ПравилоКонвертации.ОбъектДанных                       = Метаданные.Документы.кфк_т_ТестовыйДокумент;
	ПравилоКонвертации.ОбъектФормата                      = "TestDocuments";
	ПравилоКонвертации.ВариантИдентификации               = "СначалаПоУникальномуИдентификаторуПотомПоПолямПоиска";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Дата",            "date");
	ДобавитьПКС(СвойстваШапки, "Комментарий",     "comment");
	ДобавитьПКС(СвойстваШапки, "Номер",           "number");
	ДобавитьПКС(СвойстваШапки, "ПометкаУдаления", "deleted");
	ДобавитьПКС(СвойстваШапки, "Проведен",        "conducted");
	ДобавитьПКС(СвойстваШапки, "Ссылка",          "id");
	ПравилоКонвертации.ПоляПоиска.Добавить("Дата,Номер");
КонецПроцедуры


#КонецОбласти
// Документы
#Область РегистрыНакопления
Процедура ДобавитьПКО_РегистрНакопления_ТестовыйРегистрНакоп_Отправка(ПравилаКонвертации)
	ПравилоКонвертации = кфкОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО            = "РегистрНакопления_ТестовыйРегистрНакоп_Отправка";
	ПравилоКонвертации.ОбъектДанных      = Метаданные.РегистрыНакопления.кфк_т_ТестовыйРегистрНакопления;
	ПравилоКонвертации.ОбъектФормата     = "TestAccumulationRegisters";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Активность",    "isActive");
	ДобавитьПКС(СвойстваШапки, "Значение",      "value");
	ДобавитьПКС(СвойстваШапки, "Идентификатор", "identifier");
	ДобавитьПКС(СвойстваШапки, "Период",        "period");
	ДобавитьПКС(СвойстваШапки, "Регистратор",   "document");
КонецПроцедуры


#КонецОбласти
// РегистрыНакопления
#Область РегистрыСведений
Процедура ДобавитьПКО_РегистрСведений_ТестовыйРегистрСведений(ПравилаКонвертации)
	ПравилоКонвертации = кфкОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО                             = "РегистрСведений_ТестовыйРегистрСведений";
	ПравилоКонвертации.ОбъектДанных                       = Метаданные.РегистрыСведений.кфк_т_ТестовыйРегистрСведений;
	ПравилоКонвертации.ОбъектФормата                      = "TestInformationRegisters";
	ПравилоКонвертации.ВариантИдентификации               = "ПоПолямПоиска";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Булево",         "isBoolean");
	ДобавитьПКС(СвойстваШапки, "ДатаИВремя",     "dateTime");
	ДобавитьПКС(СвойстваШапки, "Идентификатор",  "identifierId");
	ДобавитьПКС(СвойстваШапки, "Комментарий",    "comment");
	ДобавитьПКС(СвойстваШапки, "Период",         "period");
	ДобавитьПКС(СвойстваШапки, "Строка",         "string");
	ДобавитьПКС(СвойстваШапки, "ТестоваяСсылка", "testReferenceId");
	ДобавитьПКС(СвойстваШапки, "Число",          "number");
	ПравилоКонвертации.ПоляПоиска.Добавить("Период,ТестоваяСсылка,Булево,Строка,Число,ДатаИВремя,Идентификатор");
КонецПроцедуры

Процедура ДобавитьПКО_РегистрСведений_ТестовыйРегистрСведенийПР_Отправка(ПравилаКонвертации)
	ПравилоКонвертации = кфкОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО            = "РегистрСведений_ТестовыйРегистрСведенийПР_Отправка";
	ПравилоКонвертации.ОбъектДанных      = Метаданные.РегистрыСведений.кфк_т_ТестовыйРегистрСведенийПР;
	ПравилоКонвертации.ОбъектФормата     = "TestInformationRegistersPR";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Активность",    "isActive");
	ДобавитьПКС(СвойстваШапки, "Значение",      "value");
	ДобавитьПКС(СвойстваШапки, "Идентификатор", "identifier");
	ДобавитьПКС(СвойстваШапки, "Период",        "period");
	ДобавитьПКС(СвойстваШапки, "Регистратор",   "document");
КонецПроцедуры


#КонецОбласти
// РегистрыСведений
#Область Справочники
Процедура ДобавитьПКО_Справочник_ТестовыйСправочник(ПравилаКонвертации)
	ПравилоКонвертации = кфкОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО                             = "Справочник_ТестовыйСправочник";
	ПравилоКонвертации.ОбъектДанных                       = Метаданные.Справочники.кфк_т_ТестовыйСправочник;
	ПравилоКонвертации.ОбъектФормата                      = "TestCatalogs";
	ПравилоКонвертации.ВариантИдентификации               = "ПоУникальномуИдентификатору";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Булево",                    "isEnabled");
	ДобавитьПКС(СвойстваШапки, "ДатаИВремя",                "dateTime");
	ДобавитьПКС(СвойстваШапки, "ИмяПредопределенныхДанных", "predefinedDataName");
	ДобавитьПКС(СвойстваШапки, "Комментарий",               "comment");
	ДобавитьПКС(СвойстваШапки, "Наименование",              "name");
	ДобавитьПКС(СвойстваШапки, "Перечисление",              "enumeration", , "Перечисление_ТестовоеПеречисление");
	ДобавитьПКС(СвойстваШапки, "ПометкаУдаления",           "deleted");
	ДобавитьПКС(СвойстваШапки, "Ссылка",                    "id");
	ДобавитьПКС(СвойстваШапки, "Число",                     "number");
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "ТабличнаяЧасть", "tableRows");
	ДобавитьПКС(СвойстваТЧ, "ДатаИВремя", "dateTime");
	ДобавитьПКС(СвойстваТЧ, "Строка",     "string");

КонецПроцедуры


#КонецОбласти
// Справочники

#КонецОбласти


Функция ДобавитьПКТЧ(ПравилоКонвертации, ИмяТЧКонфигурации, ИмяТЧФормата, ПространствоИмен = "")
	
	Если ПравилоКонвертации.СвойстваТабличныхЧастей.Колонки.Количество() = 0 Тогда
		кфкОбменДаннымиXDTOСервер.ИнициализироватьСвойстваТабличныхЧастей(ПравилоКонвертации);
	КонецЕсли;
	
	КонвертацияТабличнойЧасти                = ПравилоКонвертации.СвойстваТабличныхЧастей.Добавить();
	КонвертацияТабличнойЧасти.ТЧКонфигурации = ИмяТЧКонфигурации;
	КонвертацияТабличнойЧасти.ТЧФормата      = ИмяТЧФормата;
	КонвертацияТабличнойЧасти.Свойства       = кфкОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации();
	КонвертацияТабличнойЧасти.ПространствоИмен = ПространствоИмен;
	Возврат КонвертацияТабличнойЧасти.Свойства;
КонецФункции

Процедура ДобавитьПКС(РодительПКС, СвойствоКонфигурации, СвойствоФормата, ИспользуетсяАлгоритмКонвертации = 0, 
		ПравилоКонвертацииСвойства = "", ПространствоИмен = "")
	НоваяСтрока                                 = РодительПКС.Добавить();
	НоваяСтрока.СвойствоКонфигурации            = СвойствоКонфигурации;
	НоваяСтрока.СвойствоФормата                 = СвойствоФормата;
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = ?(ИспользуетсяАлгоритмКонвертации = 0, Ложь, Истина);
	НоваяСтрока.ПравилоКонвертацииСвойства      = ПравилоКонвертацииСвойства;
	НоваяСтрока.ПространствоИмен                = ПространствоИмен;
КонецПроцедуры

#Область ОбработчикиКонвертации

#КонецОбласти
#Область Алгоритмы


#КонецОбласти

#Область КФК

// Возвращает свойство сообщения
// 
// Параметры:
//	КомпонентыОбмена - см. кфккфкОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена 
//	ИмяСвойства - Строка - Имя свойства
// 
// Возвращаемое значение:
//	Неопределено, Произвольный - Значение свойства сообщения
Функция СвойствоСообщения(КомпонентыОбмена, ИмяСвойства)
	
	Результат = Неопределено;
	Если Не КомпонентыОбмена.СвойстваСообщения.Свойство(ИмяСвойства, Результат) Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Неправильно задано имя свойства сообщения: %1'"), ИмяСвойства);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Устанавливает флаг пропуска и добавляет комментарий в протокол
// 
// Параметры:
//	КомпонентыОбмена - см. кфккфкОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена
//	ТекстСообщения - Строка - Текст сообщения
Процедура Пропустить(КомпонентыОбмена, ТекстСообщения = "")
	
	КомпонентыОбмена.ФлагПропустить = Истина;
	
	Если Не ПустаяСтрока(ТекстСообщения) Тогда
		КомпонентыОбмена.ПротоколКонвертации.Добавить(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

// Добавляет ошибку в протокол.
// 
// Параметры:
//	КомпонентыОбмена - см. кфккфкОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена 
//	ТекстОшибки - Строка - Текст ошибки
Процедура Ошибка(КомпонентыОбмена, ТекстОшибки)
	
	КомпонентыОбмена.ФлагОшибки = Истина;
	
	Если Не ПустаяСтрока(ТекстОшибки) Тогда
		КомпонентыОбмена.ПротоколКонвертации.Добавить(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

#Область СобытияРегистрации

// Это регистрация при записи.
// 
// Параметры:
//	КомпонентыОбмена - см. кфккфккфкОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена
// 
// Возвращаемое значение:
//  Булево - Это регистрация при записи
Функция ЭтоРегистрацияПриЗаписи(КомпонентыОбмена)
	
	Если КомпонентыОбмена.НаправлениеОбмена <> "Отправка" Тогда
		ВызватьИсключение НСтр("ru = 'Неверное направление обмена!'");
	КонецЕсли;
	
	Событие = СвойствоСообщения(КомпонентыОбмена, "СобытиеРегистрации");
	Если Событие = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Не указано событие регистрации!'");
	КонецЕсли;
	
	Возврат Событие = Перечисления.кфкСобытияРегистрации.ПриЗаписи;
	
КонецФункции

// Это регистрация программно.
// 
// Параметры:
//	КомпонентыОбмена - см. кфккфккфкОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена
// 
// Возвращаемое значение:
//  Булево - Это регистрация программно
Функция ЭтоРегистрацияПрограммно(КомпонентыОбмена)
	
	Если КомпонентыОбмена.НаправлениеОбмена <> "Отправка" Тогда
		ВызватьИсключение НСтр("ru = 'Неверное направление обмена!'");
	КонецЕсли;
	
	Событие = СвойствоСообщения(КомпонентыОбмена, "СобытиеРегистрации");
	Если Событие = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Не указано событие регистрации!'");
	КонецЕсли;
	
	Возврат Событие = Перечисления.кфкСобытияРегистрации.Программно;
	
КонецФункции

// Это регистрация принудительно.
// 
// Параметры:
//	КомпонентыОбмена - см. кфккфккфкОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена
// 
// Возвращаемое значение:
//  Булево - Это регистрация принудительно
Функция ЭтоРегистрацияПринудительно(КомпонентыОбмена)
	
	Если КомпонентыОбмена.НаправлениеОбмена <> "Отправка" Тогда
		ВызватьИсключение НСтр("ru = 'Неверное направление обмена!'");
	КонецЕсли;
	
	Событие = СвойствоСообщения(КомпонентыОбмена, "СобытиеРегистрации");
	Если Событие = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Не указано событие регистрации!'");
	КонецЕсли;
	
	Возврат Событие = Перечисления.кфкСобытияРегистрации.Принудительно;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти
